{"name":"claim","types":[{"name":"v","definitions":[{"meaning":"(表示真实性say sth is true) [t]宣称；声称；断言\nto say that sth is true although it has not been proved and other people may not believe it","examples":[{"content":"He claims (that) he was not given a fair hearing.\n他声称他未得到公正的申诉机会。"},{"content":"I don't claim to be an expert.\n我不敢自称为专家。"}]},{"meaning":"(要求合法权利demand legal right) [t]~ sth要求（拥有）；索取；认领\nto demand or ask for sth because you believe it is your legal right to own or to have it","examples":[{"content":"A lot of lost property is never claimed.\n许多失物从未被认领。"},{"content":"He claimed political asylum.\n他要求政治避难。"}]},{"meaning":"(金钱money) [t][i]索要；索取\nto ask for money from the government or a company because you have a right to it","examples":[{"content":"He's not entitled to claim unemployment benefit.\n他无权要求领取失业救济金。"},{"content":"You could have claimed the cost of the hotel room from your insurance.\n你本可以从你的保险中索取旅馆住房费。"}]},{"meaning":"(注意；思考attention/thought) [t]~ sth引起注意\nto get or take sb's attention","examples":[{"content":"A most unwelcome event claimed his attention.\n一件非常讨厌的事情需要他去考虑。"}]},{"meaning":"(获得；赢得gain/win) [t]~ sth获得；赢得；取得\nto gain, win or achieve sth","examples":[{"content":"She has finally claimed a place on the team.\n她终于成了那支队的队员。"}]},{"meaning":"(导致死亡cause death) [t]~ sth夺走，夺去（生命）\nto cause sb's death","examples":[{"content":"The car crash claimed three lives.\n那次撞车事故导致三人死亡。"}]}]},{"name":"n","definitions":[{"meaning":"(表示真实saying sth is true)[c]~ (that…)声明；宣称；断言\na statement that sth is true although it has not been proved and other people may not agree with or believe it","examples":[{"content":"The singer has denied the magazine's claim that she is leaving the band.\n这名歌手已否认那家杂志有关她要离开乐队的说法。"}]},{"meaning":"(合法权利legal right) [c][u]~ (on/to sth)（尤指对财产、土地等要求拥有的）所有权\na right that sb believes they have to sth, especially property, land, etc.","examples":[{"content":"They had no claim on the land.\n他们无权索要那块土地。"},{"content":"She has more claim to the book's success than anybody(= she deserves to be praised for it) .\n她为这本书的成功立了头功。"}]},{"meaning":"(钱款for money)[c] ~ (for sth)（尤指向公司、政府等）索款，索赔\na request for a sum of money that you believe you have a right to, \nespecially from a company, the government, etc.","examples":[{"content":"You can make a claim on your insurance policy.\n你可按保险单索赔。"},{"content":"a claim for £2 000\n要求 2 000 英镑的索赔"},{"content":"Make sure your claims for expenses are submitted by the end of the month.\n你的费用一定要在月底以前办理报销。"}]}]}]}