{"name":"hold up","types":[{"name":"","definitions":[{"meaning":"举起;抬起;提起 \nIf you hold up your hand or something you have in your hand, \nyou move it upwards into a particular position and keep it there.","examples":[{"content":"She held up her hand stiffly...\n她直挺挺地举着手"},{"content":"Hold it up so that we can see it.\n把它举起来让我们看看。"}]},{"meaning":"支撑;支承 \nIf one thing holds up another, \nit is placed under the other thing in order to support it and prevent it from falling.","examples":[{"content":"Mills have iron pillars all over the place holding up the roof...\n工厂里四处都立有铁柱支撑着房顶。"},{"content":"Her legs wouldn't hold her up.\n她双腿都站不住了。"}]},{"meaning":"耽搁;阻延 \nTo hold up a person or process means to make them late or delay them. →see usage note at:cancel","examples":[{"content":"Why were you holding everyone up?...\n你为什么耽搁了大家？"},{"content":"Continuing violence could hold up progress towards reform.\n持续的暴力活动可能会阻延改革的进程。"}]},{"meaning":"持械抢劫 \nIf someone holds up a place such as a bank or a shop, \nthey point a weapon at someone there to make them give them money or valuable goods.","examples":[{"content":"A thief ran off with hundreds of pounds yesterday after holding up a petrol station.\n一名窃贼昨天持械抢劫一家加油站后带着数百英镑逃跑了。"}]},{"meaning":"举出…作为批评（或赞扬）的对象 \nIf you hold up something such as someone's behaviour, \nyou make it known to other people, so that they can criticize or praise it.","examples":[{"content":"She said the picture that had appeared in a Sunday newspaper had held her up to ridicule...\n她说一份周日的报纸上刊登的照片使她备受嘲讽。"}]},{"meaning":"维持;保持良好 \nIf something such as a type of business holds up in difficult conditions, it stays in a reasonably good state.","examples":[{"content":"Children's wear is one area that is holding up well in the recession.\n童装是经济衰退中仍然保持良好发展的一个领域。"}]},{"meaning":"（论点、理论等）经受得住检验 \nIf an argument or theory holds up, it is true or valid, even after close examination.","examples":[{"content":"I'm not sure if the argument holds up, but it's stimulating.\n我不能肯定该论点是否经得起检验，但它很有新意。"}]}]}]}