{"name":"review","types":[{"name":"n","definitions":[{"meaning":"[u][c]评审，审查，检查，检讨（以进行必要的修改）\nan examination of sth, with the intention of changing it if necessary","examples":[{"content":"the government's review of its education policy\n政府对其教育政策的检讨"},{"content":"The case is subject to judicial review .\n这个案子必须接受司法审查。"}]},{"meaning":"[c][u]\n（对图书、戏剧、电影等的）评介，评论\na report in a newspaper or magazine, or on the Internet, television or radio, in which sb gives their opinion of a book, play, film/movie, etc.;\nthe act of writing this kind of report","examples":[{"content":"a book review\n书评"},{"content":"the reviews (page) in the papers\n报纸的评论版"},{"content":"He submitted his latest novel for review.\n他提交了自己的最新小说供评论。"}]},{"meaning":"[c]报告；汇报；述评；回顾\na report on a subject or on a series of events","examples":[{"content":"a review of customer complaints\n有关消费者投诉的汇报"},{"content":"to publish a review of recent cancer research\n发表有关最近癌症研究的报告"}]},{"meaning":"[c]阅兵式；检阅\na ceremony that involves an official inspection of soldiers, etc. by an important visitor","examples":[]},{"meaning":"[c]（尤指为准备考试的）温习课，复习课\na lesson in which you look again at sth you have studied, especially in order to prepare for an exam","examples":[]}]},{"name":"v","definitions":[{"meaning":"~ sth复查；重新考虑\nto carefully examine or consider sth again, especially so that you can decide if it is necessary to make changes","examples":[{"content":"to review the evidence\n复查证据"},{"content":"The government will review the situation later in the year.\n政府将在今年晚些时候对形势重新加以研究。"}]},{"meaning":"~ sth回顾；反思\nto think about past events, for example to try to understand why they happened","examples":[{"content":"to review your failures and triumphs\n回顾自己的成功和失败"},{"content":"She had been reviewing the previous week on her way home.\n她在回家的路上对前一个星期进行了回顾。"}]},{"meaning":"~ sth写（关于书籍、戏剧、电影等的）评论；评介\nto write a report of a book, play, film/movie, etc. in which you give your opinion of it","examples":[{"content":"The play was reviewed in the national newspapers.\n全国性报纸都对这部戏剧作了评论。"}]},{"meaning":"~ sb/sth检阅（部队）\nto make an official inspection of a group of soldiers, etc. in a military ceremony","examples":[]},{"meaning":"~ sth\n（尤指为准备考试而）温习，复习to look again at sth you have studied, especially in order to prepare for an exam","examples":[]},{"meaning":"~ sth校阅；审核\nto check a piece of work to see if there are any mistakes","examples":[]}]}]}