{"name":"strain","types":[{"name":"n","definitions":[{"meaning":"(担忧；焦虑worry/anxiety)[u][c]压力；重负；重压之下出现的问题（或担忧等）\npressure on sb/sth because they have too much to do or manage,\nor sth very difficult to deal with; the problems, worry or anxiety that this produces","examples":[{"content":"Their marriage is under great strain at the moment.\n眼下他们的婚姻关系非常紧张。"},{"content":"Relax, and let us take the strain(= do things for you) .\n你歇一下，我们来顶一会儿。"},{"content":"These repayments are putting a strain on our finances.\n偿还这些债务对我们的财务状况形成了压力"}]},{"meaning":"(物理压力physical pressure)[u][c]压力；拉力；张力；应力\nthe pressure that is put on sth when a physical force stretches, pushes, or pulls it","examples":[{"content":"The rope broke under the strain .\n绳子给拉断了。"},{"content":"You should try not to place too much strain on muscles and joints.\n你要尽量不让肌肉和关节太吃力。"}]},{"meaning":"(损伤injury) [c][u]劳损；拉伤；扭伤\nan injury to a part of your body, such as a muscle, that is caused by using it too much or by twisting it","examples":[{"content":"a calf/groin/leg strain\n腿肚子╱腹股沟╱腿部拉伤"},{"content":"muscle strain\n肌肉劳损"}]},{"meaning":"(动植物╱疾病种类type of plant/animal/disease) [c]（动、植物的）系，品系，品种；（疾病的）类型\na particular type of plant or animal, or of a disease caused by bacteria, etc.","examples":[{"content":"a new strain of mosquitoes resistant to the poison\n对这种毒药有抗药性的新品种蚊子"},{"content":"This is only one of the many strains of the disease.\n这种病有许多类型，这只是其中之一。"}]},{"meaning":"(性格in sb's character) [c][ususing]个性特点；性格倾向；禀性\na particular tendency in the character of a person or group, or a quality in their manner","examples":[{"content":"He had a definite strain of snobbery in him.\n他这个人明显有一股势利小人的气味。"}]},{"meaning":"(音乐of music) [c][usupl]乐曲；曲调；旋律\nthe sound of music being played or sung","examples":[{"content":"She could hear the strains of Mozart through the window.\n她听见从窗户飘出的莫扎特的旋律。"}]}]},{"name":"v","definitions":[{"meaning":"(损伤injure) [t]~ sth/yourself损伤；拉伤；扭伤\nto injure yourself or part of your body by making it work too hard","examples":[{"content":"to strain a muscle\n拉伤肌肉"}]},{"meaning":"(尽力make effort) [t][i]尽力；竭力；使劲\nto make an effort to do sth, using all your mental or physical strength","examples":[{"content":"I strained my ears(= listened very hard) to catch what they were saying.\n我竖起耳朵去听他们在说些什么。"},{"content":"Necks were strained for a glimpse of the stranger.\n大家伸长了脖子想看一看这个陌生人。"}]},{"meaning":"(使达到极限stretch to limit) [t]~ sth过度使用；使不堪承受\nto try to make sth do more than it is able to do","examples":[{"content":"The sudden influx of visitors is straining hotels in the town to the limit.\n游客突然涌入，城里的旅馆全都爆满"},{"content":"The dispute has strained relations between the two countries(= made them difficult) .\n这场争端使两国关系紧张起来"}]},{"meaning":"(用力推╱拉push/pull hard) [i]+ adv./prep.用力推（或拉）；拉紧\nto push hard against sth; to pull hard on sth","examples":[{"content":"She strained against the ropes that held her.\n她使劲挣了挣拴着她的绳子。"}]},{"meaning":"（过滤separate solid from liquid） [t]滤；过滤\nto pour food, etc. through sth with very small holes in it, \nfor example a sieve , in order to separate the solid part from the liquid part","examples":[{"content":"Strain off any excess liquid.\n滤掉多余的液体。"},{"content":"Use a colander to strain the vegetables.\n把蔬菜放在漏筐里控控水。"}]}]}]}