{"name":"stuff","types":[{"name":"n","definitions":[{"meaning":"[uncountable ( informal, sometimes disapproving)\nused to refer to a substance, material, group of objects, etc. when you do not know the name,\n when the name is not important or when it is obvious what you are talking about \n（事物名称不详、无关紧要或所指事物明显时用）东西，物品，玩意儿","examples":[{"content":"What's all that sticky stuff on the carpet? \n地毯上那黏乎乎的都是什么玩意儿？"},{"content":"The chairs were covered in some sort of plastic stuff. \n椅子都包了一种塑料膜。"},{"content":"( disapproving) I don't know how you can eat that stuff! \n我不明白你怎么能吃那种东西！"}]},{"meaning":"( informal) used to refer in a general way to things that people do, say, think, etc. \n（泛指）活儿，话，念头，东西","examples":[{"content":" I've got loads of stuff to do today. \n我今天有好多事儿要做。"},{"content":"I like reading and stuff. \n我喜欢看书什么的。"},{"content":"This is all good stuff.Well done! \n这一切都不错。干得漂亮！"}]},{"meaning":"stuff (of sth)\n( formal or literary) the most important feature of sth; something that sth else is based on or is made from \n基本特征；特质；根本；基础；原料","examples":[{"content":"The trip was magical; the stuff of which dreams are made. \n那次旅行很奇妙，宛如梦境。"},{"content":"Parades and marches were the very stuff of politics in the region. \n游行示威是那一地区政治活动的基本内容。"}]}]},{"name":"v","definitions":[{"meaning":"to fill a space or container tightly with sth \n填满；装满；塞满；灌满","examples":[{"content":"She had 500 envelopes to stuff with leaflets. \n她得在 500 个信封里装上传单。"}]},{"meaning":"stuff sth + adv./prep. \nto push sth quickly and carelessly into a small space\n把…塞进（或填进）","examples":[{"content":"She stuffed the money under a cushion. \n她把钱塞到软垫底下。"},{"content":"His hands were stuffed in his pockets. \n他两手插在口袋里。"}]},{"meaning":"stuff sth \nto fill a vegetable, chicken, etc. with another type of food\n 在（蔬菜、鸡等）里填入（另外一种食物）；给…装馅","examples":[{"content":"Are you going to stuff the turkey? \n你打算给火鸡加填料吗？"},{"content":"stuffed peppers \n酿柿子椒"}]},{"meaning":"( informal) to eat a lot of food or too much food; to give sb a lot or too much to eat \n（使）吃撑，吃足，吃得过饱","examples":[{"content":"He sat at the table stuffing himself.\n 他坐在桌前大吃大嚼。"}]},{"meaning":"[usually passive ] stuff sth \nto fill the dead body of an animal with material and preserve it, so that it keeps its original shape and appearance \n制作（动物）标本","examples":[{"content":"They had had their pet dog stuffed. \n他们请人把他们的宠物狗制成了标本。"}]}]}]}